wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
/*----------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.                                        */
/*                                                                                                         */
/*----------------------------------------------------------------------------*/
/* File Contents:                                                             */
/*   usci_spi_cunit.c                                                         */
/*            The test function of USCI_SPI for CUnit.                        */
/* Project:   M251                                                            */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* Includes of system headers                                                 */
/*----------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>

/*----------------------------------------------------------------------------*/
/* Includes of local headers                                                  */
/*----------------------------------------------------------------------------*/
#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "usci_spi_cunit.h"
#include "PinConfig.h"

//------------------------------------------------------------------------------
//extern unsigned int STATE0;
//extern unsigned int STATE1;
//extern unsigned int ERR_STATE0;
//extern unsigned int ERR_STATE1;

//------------------------------------------------------------------------------
static USPI_T *g_apUSPIModule[] =
{
    USPI0,
    //USPI1,
};

static uint32_t u32USPIModuleIdx = 0;

/*----------------------------------------------------------------------------*/
/* Test function                                                              */
/*----------------------------------------------------------------------------*/
void SetUSPIModuleIdx(uint32_t u32Value)
{
    u32USPIModuleIdx = u32Value;
}

uint32_t GetUSPIModuleIdx(void)
{
    return u32USPIModuleIdx;
}

void *GetUSPIModule(uint32_t u32ModuleIdx)
{
    return g_apUSPIModule[u32ModuleIdx];
}

int USCI_SPI_Tests_Init(void)
{
    return 0;
}

int USCI_SPI_Tests_Clean(void)
{
    return 0;
}

/*----------------------------------------------------------------------------*/
/* Function: function_name                                                    */
/*                                                                            */
/* Parameters:                                                                */
/*               param - [in/out], parameter_description                      */
/*               param - [in/out], parameter_description                      */
/*                                                                            */
/* Returns:      the_value                                                    */
/* Side effects: the_effect                                                   */
/* Description:                                                               */
/*               description                                                  */
/*----------------------------------------------------------------------------*/
CU_SuiteInfo suites[] =
{
    //{"USCI_SPI MACRO", USCI_SPI_Tests_Init, USCI_SPI_Tests_Clean, NULL, NULL, USCI_SPI_MacroTests},
    {"USCI_SPI API", USCI_SPI_Tests_Init, USCI_SPI_Tests_Clean, NULL, NULL, USCI_SPI_ApiTests},
    //{"USCI_SPI API_MACRO", USCI_SPI_Tests_Init, USCI_SPI_Tests_Clean, NULL, NULL, USCI_SPI_Wakeup_APIMacroTests},
    CU_SUITE_INFO_NULL
};

void InitUSPIxModulePIN(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_USPI0:
            /* Slave selection signal active/inactive/slave-under-run/bit-count-error/slave-time-out interrupt flag test */
            /* Set PB.0 (USPI0_CTL0) as output mode */
            SET_GPIO_PB0();
            GPIO_SetMode(PB, BIT0, GPIO_MODE_OUTPUT);
            GPIO_SetPullCtl(PB, BIT0, GPIO_PUSEL_DISABLE);

            /* Set PA.11 (USPI0_CLK) as GPIO output pin */
            SET_GPIO_PA11();
            GPIO_SetMode(PA, BIT11, GPIO_MODE_OUTPUT);
            GPIO_SetPullCtl(PA, BIT11, GPIO_PUSEL_DISABLE);
            /* Set PA.11 (USPI0_CLK) to low level */
            PA11 = 0;

            /* Enable self-test function */
            SYS->ALTCTL0 |= SYS_ALTCTL0_SELFTEST_Msk;
            //printf("SYS SelfTest = 0x%08X\r\n", SYS->ALTCTL0);

            /* Set PB.0 (USPI0_CTL0) to high level */
            PB0 = 1;
            break;

#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            /* Slave selection signal active/inactive/slave-under-run/bit-count-error/slave-time-out interrupt flag test */
            /* Set PB.5 (USPI1_CTL0) as output mode */
            PB->MODE = (PB->MODE & ~GPIO_MODE_MODE5_Msk) | (1 << GPIO_MODE_MODE5_Pos);
            /* Set PB.1 (USPI1_CLK) as GPIO output pin */
            SYS->GPB_MFPL &= ~SYS_GPB_MFPL_PB1MFP_Msk;
            PB->MODE = (PB->MODE & ~GPIO_MODE_MODE1_Msk) | (1 << GPIO_MODE_MODE1_Pos);
            /* Set PB.1 (USPI1_CLK) to low level */
            PB1 = 0;
            /* Enable self-test function */
            //outp32(0x40000014, 1);
            SYS->ALTCTL0 |= SYS_ALTCTL0_SELFTEST_Msk;

            /* Set PB.5 (USPI1_CTL0) to high level */
            PB5 = 1;
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            /* Slave selection signal active/inactive/slave-under-run/bit-count-error/slave-time-out interrupt flag test */
            /* Set PA.3 (USPI2_CTL0) as output mode */
            PA->MODE = (PA->MODE & ~GPIO_MODE_MODE3_Msk) | (1 << GPIO_MODE_MODE3_Pos);
            /* Set PA.2 (USPI2_CLK) as GPIO output pin */
            SYS->GPA_MFPL &= ~SYS_GPA_MFPL_PA2MFP_Msk;
            PA->MODE = (PA->MODE & ~GPIO_MODE_MODE2_Msk) | (1 << GPIO_MODE_MODE2_Pos);
            /* Set PA.1 (USPI2_CLK) to low level */
            PA2 = 0;
            /* Enable self-test function */
            //outp32(0x40000014, 1);
            SYS->ALTCTL0 |= SYS_ALTCTL0_SELFTEST_Msk;

