wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
            /* Set PA.3 (USPI2_CTL0) to high level */
            PA3 = 1;
            break;
#endif //EN_MULTI_USPI2
    }
}

void USPIxCtlHigh(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_USPI0:
            /* Set PB.0 (USPI0_CTL0) to high level */
            PB0 = 1;
            break;

#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            /* Set PB.5 (USPI1_CTL0) to high level */
            PB5 = 1;
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            /* Set PA.3 (USPI2_CTL0) to high level */
            PA3 = 1;
            break;
#endif //EN_MULTI_USPI2
    }
}

void USPIxCtlLow(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_USPI0:
            /* Set PB.0 (USPI0_CTL0) to low level */
            PB0 = 0;
            break;

#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            /* Set PB.5 (USPI1_CTL0) to low level */
            PB5 = 0;
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            /* Set PA.3 (USPI2_CTL0) to low level */
            PA3 = 0;
            break;
#endif //EN_MULTI_USPI2
    }
}

void USPIxClkHigh(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_USPI0:
            /* Set PA.11 (USPI0_CLK) to low level */
            PA11 = 1;
            break;

#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            /* Set PB.1 (USPI0_CLK) to low level */
            PB1 = 1;
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            /* Set PA.2 (USPI0_CLK) to low level */
            PA2 = 1;
            break;
#endif //EN_MULTI_USPI2
    }
}

void USPIxClkLow(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_USPI0:
            /* Set PA.11 (USPI0_CLK) to low level */
            PA11 = 0;
            break;

#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            /* Set PB.1 (USPI0_CLK) to low level */
            PB1 = 0;
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            /* Set PA.2 (USPI0_CLK) to low level */
            PA2 = 0;
            break;
#endif //EN_MULTI_USPI2
    }
}

void ResetUSPIxModule(uint32_t u32Module)
{
    SYS_UnlockReg();

    switch (u32Module)
    {
        case C_USPI0:
            /* Reset USPI0 */
            SYS->USCIRST |= (1 << (SYS_USCIRST_USCI0RST_Pos));
            SYS->USCIRST &= ~(SYS_USCIRST_USCI0RST_Msk);
            break;

#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            /* Reset USPI1 */
            SYS->USCIRST |= (1 << (SYS_USCIRST_USCI1RST_Pos));
            SYS->USCIRST &= ~(SYS_USCIRST_USCI1RST_Msk);
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            /* Reset USPI1 */
            SYS->USCIRST |= (1 << (SYS_USCIRST_USCI2RST_Pos));
            SYS->USCIRST &= ~(SYS_USCIRST_USCI2RST_Msk);
            break;
#endif //EN_MULTI_USPI2
    }

    SYS_LockReg();
}

//------------------------------------------------------------------------------
void MACRO_USCI_SPI_ENABLE_DISABLE_3WIRE_MODE()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;

    /* Check SLV3WIRE bit */
    CU_ASSERT_FALSE(pUSPIModule->PROTCTL & 0x00000002);
    USPI_ENABLE_3WIRE_MODE(pUSPIModule);
    /* Check SLV3WIRE bit */
    CU_ASSERT_TRUE(pUSPIModule->PROTCTL & 0x00000002);
    USPI_DISABLE_3WIRE_MODE(pUSPIModule);
    CU_ASSERT_FALSE(pUSPIModule->PROTCTL & 0x00000002);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_GET_RX_EMPTY_FLAG()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    /* Master mode, USPI mode 0. */
    pUSPIModule->PROTCTL = USPI_MASTER | USPI_MODE_0;
    pUSPIModule->LINECTL = 0;
    /* Set USCI_SPI0 clock rate = f_PCLK0 / 2*(5+1) */
    pUSPIModule->BRGEN = (pUSPIModule->BRGEN & (~USPI_BRGEN_CLKDIV_Msk)) | (5 << USPI_BRGEN_CLKDIV_Pos);
    /* Enable USCI_SPI0 protocol */
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    /* Check RX_EMPTY flag */
    CU_ASSERT(USPI_GET_RX_EMPTY_FLAG(pUSPIModule) == 1);
    pUSPIModule->TXDAT = 1;

    /* Check busy state */
    while (USPI_IS_BUSY(pUSPIModule))
    {
        __NOP();
    }

    /* Check RX_EMPTY flag */
    CU_ASSERT(USPI_GET_RX_EMPTY_FLAG(pUSPIModule) == 0);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_GET_TX_EMPTY_FULL_FLAG()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    /* Slave mode, USPI mode 0. */
    pUSPIModule->PROTCTL = USPI_SLAVE | USPI_MODE_0;
    pUSPIModule->LINECTL = 0;
    /* Set USCI_SPI0 clock rate = f_PCLK0 */
    pUSPIModule->BRGEN = pUSPIModule->BRGEN & (~USPI_BRGEN_CLKDIV_Msk);
    /* Enable USCI_SPI0 protocol */
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    /* Check TX_EMPTY flag */
    CU_ASSERT(USPI_GET_TX_EMPTY_FLAG(pUSPIModule) == 1);
    /* Check TX_FULL flag */
    CU_ASSERT(USPI_GET_TX_FULL_FLAG(pUSPIModule) == 0);
    pUSPIModule->TXDAT = 1;
    /* Check TX_EMPTY flag */
    CU_ASSERT(USPI_GET_TX_EMPTY_FLAG(pUSPIModule) == 0);
    /* Check TX_FULL flag */
    CU_ASSERT(USPI_GET_TX_FULL_FLAG(pUSPIModule) == 1);
    pUSPIModule->TXDAT = 2;
    pUSPIModule->TXDAT = 3;
    pUSPIModule->TXDAT = 4;
    /* Check TX_FULL flag */
    CU_ASSERT(USPI_GET_TX_FULL_FLAG(pUSPIModule) == 1);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_WRITE_TX_READ_RX()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;

    //Enable SELFTEST
    switch (GetUSPIModuleIdx())
    {
        case C_USPI0:
            *(volatile uint32_t *)(USCI0_BASE + 0x84) |= (1 << 30);
            break;
#if (EN_MULTI_USPI1 == 1)

        case C_USPI1:
            *(volatile uint32_t *)(USCI1_BASE + 0x84) |= (1 << 30);
            break;
#endif //EN_MULTI_USPI1

#if (EN_MULTI_USPI2 == 1)

        case C_USPI2:
            *(volatile uint32_t *)(USCI2_BASE + 0x84) |= (1 << 30);
            break;
#endif //EN_MULTI_USPI2
    }

    /* Master mode, USPI mode 0. */
    pUSPIModule->PROTCTL = USPI_MASTER | USPI_MODE_0;
    pUSPIModule->LINECTL = 0;
    /* Set USCI_SPI0 clock rate = f_PCLK0 / 2*(5+1) */
    pUSPIModule->BRGEN = (pUSPIModule->BRGEN & (~USPI_BRGEN_CLKDIV_Msk)) |
                         (5 << USPI_BRGEN_CLKDIV_Pos);
    /* Enable USCI_SPI0 protocol */
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

