wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
    /* Write 3 data to TX register */
    USPI_WRITE_TX(pUSPIModule, 1);

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    USPI_WRITE_TX(pUSPIModule, 2);

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    USPI_WRITE_TX(pUSPIModule, 3);
    CU_ASSERT(USPI_READ_RX(pUSPIModule) == 1);

    /* Wait data transfer */
    while (pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk)
    {
        __NOP();
    }

    /* Read data from RX register */
    CU_ASSERT(USPI_READ_RX(pUSPIModule) == 2);
    CU_ASSERT(USPI_READ_RX(pUSPIModule) == 3);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_SET_SS_HIGH()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    USPI_SET_SS_HIGH(pUSPIModule);
    CU_ASSERT_FALSE(pUSPIModule->LINECTL & 0x00000080);
    CU_ASSERT(pUSPIModule->PROTCTL == 0x80000304);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_SET_SS_LOW()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    USPI_SET_SS_LOW(pUSPIModule);
    CU_ASSERT_TRUE(pUSPIModule->LINECTL & 0x00000080);
    CU_ASSERT(pUSPIModule->PROTCTL == 0x80000300);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_SET_SUSPEND_CYCLE()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;

    USPI_SET_SUSPEND_CYCLE(pUSPIModule, 0);
    CU_ASSERT((pUSPIModule->PROTCTL & 0x00000F00) == 0);
    USPI_SET_SUSPEND_CYCLE(pUSPIModule, 8);
    CU_ASSERT((pUSPIModule->PROTCTL & 0x00000F00) == 0x00000800);
    USPI_SET_SUSPEND_CYCLE(pUSPIModule, 15);
    CU_ASSERT((pUSPIModule->PROTCTL & 0x00000F00) == 0x00000F00);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_SET_LSB_MSB_FIRST()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;

    USPI_SET_LSB_FIRST(pUSPIModule);
    CU_ASSERT_TRUE(pUSPIModule->LINECTL & 0x00000001);
    USPI_SET_MSB_FIRST(pUSPIModule);
    CU_ASSERT_FALSE(pUSPIModule->LINECTL & 0x00000001);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_SET_DATA_WIDTH()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;

    USPI_SET_DATA_WIDTH(pUSPIModule, 16);
    CU_ASSERT((pUSPIModule->LINECTL & 0x00000F00) == 0);
    USPI_SET_DATA_WIDTH(pUSPIModule, 8);
    CU_ASSERT((pUSPIModule->LINECTL & 0x00000F00) == 0x00000800);
    USPI_SET_DATA_WIDTH(pUSPIModule, 4);
    CU_ASSERT((pUSPIModule->LINECTL & 0x00000F00) == 0x00000400);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_IS_BUSY()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    /* master mode, USPI mode 0. */
    pUSPIModule->PROTCTL = USPI_MASTER | USPI_MODE_0;
    pUSPIModule->LINECTL = 0;
    /* Set USCI_SPI0 clock rate = f_PCLK0 */
    pUSPIModule->BRGEN = pUSPIModule->BRGEN & (~USPI_BRGEN_CLKDIV_Msk);
    /* Enable USCI_SPI0 protocol */
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    pUSPIModule->TXDAT = 1;
    CU_ASSERT_TRUE(USPI_IS_BUSY(pUSPIModule));

    /* Wait data transfer */
    while (pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk)
    {
        __NOP();
    }

    CU_ASSERT_FALSE(USPI_IS_BUSY(pUSPIModule));

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_GetIntFlag_ClearIntFlag()
{
    volatile uint32_t u32DelayCount = 0;
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    /* Master mode, USPI mode 0. */
    pUSPIModule->PROTCTL = USPI_MASTER | USPI_MODE_0;
    pUSPIModule->LINECTL = 0;
    /* Set USCI_SPI0 clock rate = f_PCLK0 / 2*(359+1) */
    pUSPIModule->BRGEN = (pUSPIModule->BRGEN & (~USPI_BRGEN_CLKDIV_Msk)) |
                         (359 << USPI_BRGEN_CLKDIV_Pos);
    /* Enable USCI_SPI0 protocol */
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    USPIxCtlLow(GetUSPIModuleIdx());

    pUSPIModule->TXDAT = 0x1112;

    while ((pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_TXSTIF_Msk) == USPI_PROTSTS_TXSTIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_TXSTIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_TXSTIF_Msk) == 0);

    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_TXENDIF_Msk) == USPI_PROTSTS_TXENDIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_TXENDIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_TXENDIF_Msk) == 0);

    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_RXSTIF_Msk) == USPI_PROTSTS_RXSTIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_RXSTIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_RXSTIF_Msk) == 0);

    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_RXENDIF_Msk) == USPI_PROTSTS_RXENDIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_RXENDIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_RXENDIF_Msk) == 0);

    pUSPIModule->TXDAT = 0x1113;

    while ((pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk) != 0)
    {
        __NOP();
    }

