wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
    pUSPIModule->TXDAT = 0x1114;

    while ((pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_RXOVIF_Msk) == USPI_BUFSTS_RXOVIF_Msk);
    USPI_CLR_BUF_INT_FLAG(pUSPIModule, USPI_BUFSTS_RXOVIF_Msk);
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_RXOVIF_Msk) == 0);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
    __NOP();

    InitUSPIxModulePIN(GetUSPIModuleIdx());

    /* Slave selection signal is low-active; set slave time-out period. */
    pUSPIModule->CTL = 1;
    pUSPIModule->CTLIN0 = 1 << USPI_CTLIN0_ININV_Pos;
    pUSPIModule->PROTCTL = (pUSPIModule->PROTCTL & (~USPI_PROTCTL_SLVTOCNT_Msk)) | (50 << USPI_PROTCTL_SLVTOCNT_Pos);

    /* Slave mode, USPI mode 0. */
    pUSPIModule->LINECTL = (0 << USPI_LINECTL_DWIDTH_Pos) | USPI_LINECTL_LSB_Msk;
    pUSPIModule->PROTCTL |= (USPI_PROTCTL_PROTEN_Msk |
                             (0 << USPI_PROTCTL_SCLKMODE_Pos) |
                             USPI_PROTCTL_SLAVE_Msk);
    pUSPIModule->BRGEN |= (1 << USPI_BRGEN_TMCNTEN_Pos);

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSACTIF_Msk) == 0);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSINAIF_Msk) == 0);
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_TXUDRIF_Msk) == 0);

    USPIxCtlLow(GetUSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    /* Check slave selection signal active interrupt flag */
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSACTIF_Msk) == USPI_PROTSTS_SSACTIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_SSACTIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSACTIF_Msk) == 0);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSINAIF_Msk) == 0);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SLVTOIF_Msk) == 0);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SLVBEIF_Msk) == 0);

    /* Check TX under run interrupt flag */
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_TXUDRIF_Msk) == USPI_BUFSTS_TXUDRIF_Msk);

    USPIxClkHigh(GetUSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++);

    USPIxClkLow(GetUSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 1000; u32DelayCount++)
    {
        __NOP();
    }

    /* Check slave time-out interrupt flag */
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SLVTOIF_Msk) == USPI_PROTSTS_SLVTOIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_SLVTOIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SLVTOIF_Msk) == 0);

    USPIxCtlHigh(GetUSPIModuleIdx());

    __NOP();
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSINAIF_Msk) == USPI_PROTSTS_SSINAIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_SSINAIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SSINAIF_Msk) == 0);

    /* Clear TX under run interrupt flag */
    USPI_CLR_BUF_INT_FLAG(pUSPIModule, USPI_BUFSTS_TXUDRIF_Msk);
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_TXUDRIF_Msk) == 0);

    /* Slave bit count error interrupt flag test */
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SLVBEIF_Msk) == USPI_PROTSTS_SLVBEIF_Msk);
    USPI_CLR_PROT_INT_FLAG(pUSPIModule, USPI_PROTSTS_SLVBEIF_Msk);
    CU_ASSERT((USPI_GET_PROT_STATUS(pUSPIModule) & USPI_PROTSTS_SLVBEIF_Msk) == 0);

    /* Disable self-test function */
    SYS->ALTCTL0 &= (~SYS_ALTCTL0_SELFTEST_Msk);

    /* Set PA.11 (USPI0_CLK) as USCI function pin */
    USPI0_CLK_PIN_INIT();

    /* Reset USPI0 */
    ResetUSPIxModule(GetUSPIModuleIdx());
    __NOP();

    /* RX overrun interrupt flag test */
    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    /* Master mode, USPI mode 0. */
    pUSPIModule->PROTCTL = USPI_MASTER | USPI_MODE_0;
    pUSPIModule->LINECTL = 0;
    /* Set USCI_SPI0 clock rate = f_PCLK0 / 2*(359+1) */
    pUSPIModule->BRGEN = (pUSPIModule->BRGEN & (~USPI_BRGEN_CLKDIV_Msk)) | 359 << USPI_BRGEN_CLKDIV_Pos;
    /* Enable USCI_SPI0 protocol */
    pUSPIModule->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;
    /* Check RX overrun interrupt flag */
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_RXOVIF_Msk) == 0);
    /* Write to TX register */
    pUSPIModule->TXDAT = 0x1115;

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    pUSPIModule->TXDAT = 0x1116;

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    pUSPIModule->TXDAT = 0x1117;

    /* Wait data transfer */
    while (pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX overrun interrupt flag */
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_RXOVIF_Msk) == USPI_BUFSTS_RXOVIF_Msk);
    USPI_CLR_BUF_INT_FLAG(pUSPIModule, USPI_BUFSTS_RXOVIF_Msk);
    CU_ASSERT((USPI_GET_BUF_STATUS(pUSPIModule) & USPI_BUFSTS_RXOVIF_Msk) == 0);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_EnableProtocolInt_DisableProtocolInt()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;

    USPI_ENABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SSINAIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x1);
    USPI_DISABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SSINAIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x1);

    USPI_ENABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SSACTIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x2);
    USPI_DISABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SSACTIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x2);

    USPI_ENABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SLVTOIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x4);
    USPI_DISABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SLVTOIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x4);

