wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
    USPI_ENABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SLVBEIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x8);
    USPI_DISABLE_PROT_INT(pUSPIModule, USPI_PROTIEN_SLVBEIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x8);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_EnableBufferInt_DisableBufferInt()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;

    USPI_ENABLE_BUF_INT(pUSPIModule, USPI_BUFCTL_TXUDRIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->BUFCTL & 0x40);
    USPI_DISABLE_BUF_INT(pUSPIModule, USPI_BUFCTL_TXUDRIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->BUFCTL & 0x40);

    USPI_ENABLE_BUF_INT(pUSPIModule, USPI_BUFCTL_RXOVIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->BUFCTL & 0x4000);
    USPI_DISABLE_BUF_INT(pUSPIModule, USPI_BUFCTL_RXOVIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->BUFCTL & 0x4000);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_EnablePDMA_DisablePDMA()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;

    USPI_TRIGGER_RX_PDMA(pUSPIModule);
    CU_ASSERT((pUSPIModule->PDMACTL & USPI_PDMACTL_RXPDMAEN_Msk) == USPI_PDMACTL_RXPDMAEN_Msk);
    USPI_DISABLE_RX_PDMA(pUSPIModule);
    CU_ASSERT((pUSPIModule->PDMACTL & USPI_PDMACTL_RXPDMAEN_Msk) == 0);
    USPI_TRIGGER_TX_PDMA(pUSPIModule);
    CU_ASSERT((pUSPIModule->PDMACTL & USPI_PDMACTL_TXPDMAEN_Msk) == USPI_PDMACTL_TXPDMAEN_Msk);
    USPI_DISABLE_TX_PDMA(pUSPIModule);
    CU_ASSERT((pUSPIModule->PDMACTL & USPI_PDMACTL_TXPDMAEN_Msk) == 0);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void MACRO_USCI_SPI_EnableTransferInt_DisableTransferInt()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Select USCI_SPI0 protocol */
    pUSPIModule->CTL &= ~USPI_CTL_FUNMODE_Msk;
    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;

    USPI_ENABLE_TRANS_INT(pUSPIModule, USPI_INTEN_TXSTIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x2);
    USPI_DISABLE_TRANS_INT(pUSPIModule, USPI_INTEN_TXSTIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x2);

    USPI_ENABLE_TRANS_INT(pUSPIModule, USPI_INTEN_TXENDIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x4);
    USPI_DISABLE_TRANS_INT(pUSPIModule, USPI_INTEN_TXENDIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x4);

    USPI_ENABLE_TRANS_INT(pUSPIModule, USPI_INTEN_RXSTIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x8);
    USPI_DISABLE_TRANS_INT(pUSPIModule, USPI_INTEN_RXSTIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x8);

    USPI_ENABLE_TRANS_INT(pUSPIModule, USPI_INTEN_RXENDIEN_Msk);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x10);
    USPI_DISABLE_TRANS_INT(pUSPIModule, USPI_INTEN_RXENDIEN_Msk);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x10);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void API_USCI_SPI_Open()
{
#if 1
    uint32_t u32ReturnValue = 0;
    uint32_t u32Pclk = 0, u32ClkDiv = 0, u32BusClock = 0;
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    u32BusClock = 1000000;
    u32Pclk = CLK_GetPCLK0Freq();
    u32ClkDiv = (uint32_t)((((((u32Pclk / 2) * 10) / (u32BusClock)) + 5) / 10) - 1);

    u32ReturnValue = USPI_Open(pUSPIModule, USPI_MASTER, USPI_MODE_0, 4, 1000000);
    CU_ASSERT(pUSPIModule->CTL == 0x00000001);
    CU_ASSERT((pUSPIModule->BRGEN & USPI_BRGEN_CLKDIV_Msk) == (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos));

    switch (GetUSPIModuleIdx())
    {
        case C_USPI0:
            CU_ASSERT(pUSPIModule->LINECTL == 0x00000480);
            CU_ASSERT(pUSPIModule->PROTCTL == 0x80000300);
            CU_ASSERT(u32ReturnValue == 1000000);
            break;

        case C_USPI1:
            CU_ASSERT(pUSPIModule->LINECTL == 0x00000480);
            CU_ASSERT(pUSPIModule->PROTCTL == 0x80000300);
            CU_ASSERT(u32ReturnValue == 1000000);
            break;

        case C_USPI2:
            CU_ASSERT(pUSPIModule->LINECTL == 0x00000C00);
            CU_ASSERT(pUSPIModule->PROTCTL == 0x80000381);
            CU_ASSERT(u32ReturnValue == 00000000);
            break;
    }

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());

#endif //0
#if 0
    uint32_t u32ReturnValue;
    uint32_t u32Pclk, u32ClkDiv, u32BusClock;

    u32BusClock = 1000000;
    u32Pclk = CLK_GetPCLK0Freq();
    u32ClkDiv = (uint32_t)((((((u32Pclk / 2) * 10) / (u32BusClock)) + 5) / 10) - 1);

    u32ReturnValue = USPI_Open(USPI0, USPI_MASTER, USPI_MODE_0, 4, 1000000);
    CU_ASSERT(USPI0->CTL == 0x00000001);
    CU_ASSERT((USPI0->BRGEN & USPI_BRGEN_CLKDIV_Msk) == (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos));
    CU_ASSERT(USPI0->LINECTL == 0x00000480);
    CU_ASSERT(USPI0->PROTCTL == 0x80000300);
    CU_ASSERT(u32ReturnValue == 1000000);

    /* Reset USPI0 */
    SYS->IPRST2 |= SYS_IPRST2_USCI0RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI0RST_Msk;

#if defined EN_MULTI_USPI1
    u32BusClock = 2000000;
    u32Pclk = CLK_GetPCLK0Freq();
    u32ClkDiv = (uint32_t)((((((u32Pclk / 2) * 10) / (u32BusClock)) + 5) / 10) - 1);

    u32ReturnValue = USPI_Open(USPI1, USPI_MASTER, USPI_MODE_1, 8, 2000000);
    CU_ASSERT(USPI1->CTL == 0x00000001);
    CU_ASSERT((USPI1->BRGEN & USPI_BRGEN_CLKDIV_Msk) == (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos));
    CU_ASSERT(USPI1->LINECTL == 0x00000880);
    CU_ASSERT(USPI1->PROTCTL == 0x80000340);
    CU_ASSERT(u32ReturnValue == 2000000);

    /* Reset USPI1 */
    SYS->IPRST2 |= SYS_IPRST2_USCI1RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI1RST_Msk;
#endif //EN_MULTI_USPI1

#if defined EN_MULTI_USPI2
    u32ReturnValue = USPI_Open(USPI2, USPI_SLAVE, USPI_MODE_2, 12, NULL);
    CU_ASSERT(USPI2->CTL == 0x00000001);
    CU_ASSERT(USPI2->BRGEN == 0x00003C00);
    CU_ASSERT(USPI2->LINECTL == 0x00000C00);
    CU_ASSERT(USPI2->PROTCTL == 0x80000381);
    CU_ASSERT(u32ReturnValue == 00000000);

    /* Reset USPI2 */
    SYS->IPRST2 |= SYS_IPRST2_USCI2RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI2RST_Msk;
#endif //EN_MULTI_USPI2

#if 0   ///
    u32ReturnValue = USPI_Open(USPI0, USPI_MASTER, USPI_MODE_3, 16, 32000000);
    CU_ASSERT(USPI0->CTL == 0x00000001);
    CU_ASSERT(USPI0->BRGEN == 0x00003C00);
    CU_ASSERT(USPI0->LINECTL == 0x00000080);
    CU_ASSERT(USPI0->PROTCTL == 0x800003C0);
    CU_ASSERT(u32ReturnValue == 36000000);
    /* Reset USPI0 */
    SYS->IPRST2 |= SYS_IPRST2_USCI0RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI0RST_Msk;
#endif
#endif //0
}

void API_USCI_SPI_Close()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 0x00000001;
    USPI_Close(pUSPIModule);
    CU_ASSERT(pUSPIModule->CTL == 0x00000000);
}

