wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
void API_USCI_SPI_ClearRxBuf()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Master mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_MASTER, USPI_MODE_0, 16, 100000);
    /* Write 1 data to TX register */
    pUSPIModule->TXDAT = 1;

    /* Wait data transfer */
    while ((pUSPIModule->PROTSTS & 0x00020000) != 0)
    {
        __NOP();
    }

    USPI_ClearRxBuf(pUSPIModule);
    CU_ASSERT(pUSPIModule->BUFSTS == 0x00000101);

    USPI_Close(pUSPIModule);
}

void API_USCI_SPI_ClearTxBuf()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Enable self-test function */
    SYS->ALTCTL0 |= SYS_ALTCTL0_SELFTEST_Msk;
    //outp32(0x40000014, 1);

    switch (GetUSPIModuleIdx())
    {
        case C_USPI0:
            //PC->MODE = (PC->MODE & ~GPIO_MODE_MODE14_Msk) |
            //           (GPIO_MODE_OUTPUT << GPIO_MODE_MODE14_Pos);
            SET_GPIO_PB0();
            GPIO_SetMode(PB, BIT0, GPIO_MODE_OUTPUT);
            GPIO_SetPullCtl(PB, BIT0, GPIO_PUSEL_DISABLE);

            PB0 = 1;
            break;

        case C_USPI1:
            PB->MODE = (PB->MODE & ~GPIO_MODE_MODE5_Msk) |
                       (GPIO_MODE_OUTPUT << GPIO_MODE_MODE5_Pos);
            PB5 = 1;
            break;

        case C_USPI2:
            PA->MODE = (PA->MODE & ~GPIO_MODE_MODE3_Msk) |
                       (GPIO_MODE_OUTPUT << GPIO_MODE_MODE3_Pos);
            PA3 = 1;
            break;
    }

    /* Slave mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_SLAVE, USPI_MODE_0, 16, NULL);
    /* Write 1 data to TX register */
    pUSPIModule->TXDAT = 1;
    CU_ASSERT((pUSPIModule->BUFSTS & 0x00000F00) == 0x00000200);
    USPI_ClearTxBuf(pUSPIModule);
    CU_ASSERT((pUSPIModule->BUFSTS & 0x00000F00) == 0x00000100);

    USPI_Close(pUSPIModule);

    /* Disable self-test function */
    //outp32(0x40000014, 0);
    SYS->ALTCTL0 &= ~SYS_ALTCTL0_SELFTEST_Msk;
}

void API_USCI_SPI_EnableAutoSS_DisableAutoSS()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    pUSPIModule->CTL = 1 << USPI_CTL_FUNMODE_Pos;
    pUSPIModule->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;

    USPI_EnableAutoSS(pUSPIModule, 0, USPI_SS_ACTIVE_HIGH);
    CU_ASSERT(pUSPIModule->PROTCTL == 0x80000308);
    CU_ASSERT(pUSPIModule->LINECTL == 0);
    USPI_DisableAutoSS(pUSPIModule);
    CU_ASSERT((pUSPIModule->PROTCTL & (USPI_PROTCTL_AUTOSS_Msk | USPI_PROTCTL_SS_Msk)) == 0x0);
    USPI_EnableAutoSS(pUSPIModule, 0, USPI_SS_ACTIVE_LOW);
    CU_ASSERT(pUSPIModule->PROTCTL == 0x80000308);
    CU_ASSERT(pUSPIModule->LINECTL == 0x80);
    USPI_DisableAutoSS(pUSPIModule);
    CU_ASSERT((pUSPIModule->PROTCTL & (USPI_PROTCTL_AUTOSS_Msk | USPI_PROTCTL_SS_Msk)) == 0x0);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void API_USCI_SPI_SetBusClock_GetBusClock()
{
    uint32_t u32ReturnValue, u32ClkDiv, u32Pclk, u32BusClock;
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    u32BusClock = 200 * 1000;
    u32Pclk = CLK_GetPCLK0Freq();
    u32ClkDiv = (uint32_t)((((((u32Pclk / 2) * 10) / (u32BusClock)) + 5) / 10) - 1) & 0x3FF;

    u32ReturnValue = USPI_SetBusClock(pUSPIModule, 200 * 1000);
    CU_ASSERT((pUSPIModule->BRGEN & USPI_BRGEN_CLKDIV_Msk) == (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos));
    CU_ASSERT(u32ReturnValue == 200 * 1000);
    u32ReturnValue = USPI_GetBusClock(pUSPIModule);
    CU_ASSERT(u32ReturnValue == 200 * 1000);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());

#if 0
    u32BusClock = 200 * 1000;
    u32Pclk = CLK_GetPCLK0Freq();
    u32ClkDiv = (uint32_t)((((((u32Pclk / 2) * 10) / (u32BusClock)) + 5) / 10) - 1) & 0x3FF;

    u32ReturnValue = USPI_SetBusClock(USPI0, 200 * 1000);
    CU_ASSERT((USPI0->BRGEN & USPI_BRGEN_CLKDIV_Msk) == (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos));
    CU_ASSERT(u32ReturnValue == 200 * 1000);
    u32ReturnValue = USPI_GetBusClock(USPI0);
    CU_ASSERT(u32ReturnValue == 200 * 1000);
    /* Reset USPI0 */
    SYS->IPRST2 |= SYS_IPRST2_USCI0RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI0RST_Msk;

#if defined EN_MULTI_USPI1
    u32BusClock = 1 * 1000 * 1000;
    u32Pclk = CLK_GetPCLK1Freq();
    u32ClkDiv = (uint32_t)((((((u32Pclk / 2) * 10) / (u32BusClock)) + 5) / 10) - 1) & 0x3FF;

    u32ReturnValue = USPI_SetBusClock(USPI1, 1 * 1000 * 1000);
    CU_ASSERT((USPI1->BRGEN & USPI_BRGEN_CLKDIV_Msk) == (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos));
    CU_ASSERT(u32ReturnValue == 1 * 1000 * 1000);
    u32ReturnValue = USPI_GetBusClock(USPI1);
    CU_ASSERT(u32ReturnValue == 1 * 1000 * 1000);
    /* Reset USPI1 */
    SYS->IPRST2 |= SYS_IPRST2_USCI1RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI1RST_Msk;
#endif //EN_MULTI_USPI1

#if defined EN_MULTI_USPI2
    u32ReturnValue = USPI_SetBusClock(USPI2, 72 * 1000 * 1000);
    CU_ASSERT(USPI2->BRGEN == 0x00003C00);
    CU_ASSERT(u32ReturnValue == 36 * 1000 * 1000);
    u32ReturnValue = USPI_GetBusClock(USPI2);
    CU_ASSERT(u32ReturnValue == 36 * 1000 * 1000);
    /* Reset USPI2 */
    SYS->IPRST2 |= SYS_IPRST2_USCI2RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI2RST_Msk;
#endif //EN_MULTI_USPI2
#endif //0
}

void API_USCI_SPI_EnableInt_DisableInt()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    USPI_Open(pUSPIModule, USPI_MASTER, USPI_MODE_0, 4, 100000);

    USPI_EnableInt(pUSPIModule, USPI_SSINACT_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x1);
    USPI_DisableInt(pUSPIModule, USPI_SSINACT_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x1);

    USPI_EnableInt(pUSPIModule, USPI_SSACT_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x2);
    USPI_DisableInt(pUSPIModule, USPI_SSACT_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x2);

    USPI_EnableInt(pUSPIModule, USPI_SLVTO_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x4);
    USPI_DisableInt(pUSPIModule, USPI_SLVTO_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x4);

