wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
    USPI_EnableInt(pUSPIModule, USPI_SLVBE_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->PROTIEN & 0x8);
    USPI_DisableInt(pUSPIModule, USPI_SLVBE_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->PROTIEN & 0x8);

    USPI_EnableInt(pUSPIModule, USPI_TXUDR_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->BUFCTL & 0x40);
    USPI_DisableInt(pUSPIModule, USPI_TXUDR_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->BUFCTL & 0x40);

    USPI_EnableInt(pUSPIModule, USPI_RXOV_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->BUFCTL & 0x4000);
    USPI_DisableInt(pUSPIModule, USPI_RXOV_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->BUFCTL & 0x4000);

    USPI_EnableInt(pUSPIModule, USPI_TXST_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x2);
    USPI_DisableInt(pUSPIModule, USPI_TXST_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x2);

    USPI_EnableInt(pUSPIModule, USPI_TXEND_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x4);
    USPI_DisableInt(pUSPIModule, USPI_TXEND_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x4);

    USPI_EnableInt(pUSPIModule, USPI_RXST_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x8);
    USPI_DisableInt(pUSPIModule, USPI_RXST_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x8);

    USPI_EnableInt(pUSPIModule, USPI_RXEND_INT_MASK);
    CU_ASSERT_TRUE(pUSPIModule->INTEN & 0x10);
    USPI_DisableInt(pUSPIModule, USPI_RXEND_INT_MASK);
    CU_ASSERT_FALSE(pUSPIModule->INTEN & 0x10);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
}

void API_USCI_SPI_GetIntFlag_ClearIntFlag()
{
    uint32_t u32DelayCount;
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Master mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_MASTER, USPI_MODE_0, 8, 1000000);
    pUSPIModule->TXDAT = 0;

    while ((pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXST_INT_MASK) == USPI_TXST_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_TXST_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXST_INT_MASK) == 0);

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXEND_INT_MASK) == USPI_TXEND_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_TXEND_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXEND_INT_MASK) == 0);

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXST_INT_MASK) == USPI_RXST_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_RXST_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXST_INT_MASK) == 0);

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXEND_INT_MASK) == USPI_RXEND_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_RXEND_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXEND_INT_MASK) == 0);

    pUSPIModule->TXDAT = 1;

    while ((pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    pUSPIModule->TXDAT = 2;

    while ((pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXOV_INT_MASK) == USPI_RXOV_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_RXOV_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXOV_INT_MASK) == 0);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
    __NOP();

    InitUSPIxModulePIN(GetUSPIModuleIdx());

    /* Slave selection signal is low-active; set slave time-out period. */
    pUSPIModule->CTL = 1;
    pUSPIModule->CTLIN0 = 1 << USPI_CTLIN0_ININV_Pos;
    pUSPIModule->PROTCTL = (pUSPIModule->PROTCTL & (~USPI_PROTCTL_SLVTOCNT_Msk)) |
                           (50 << USPI_PROTCTL_SLVTOCNT_Pos);

    /* Slave mode, USPI mode 0. */
    pUSPIModule->LINECTL = (0 << USPI_LINECTL_DWIDTH_Pos) | USPI_LINECTL_LSB_Msk;
    pUSPIModule->PROTCTL |= (USPI_PROTCTL_PROTEN_Msk |
                             (0 << USPI_PROTCTL_SCLKMODE_Pos) |
                             USPI_PROTCTL_SLAVE_Msk);
    pUSPIModule->BRGEN |= (1 << USPI_BRGEN_TMCNTEN_Pos);

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSACT_INT_MASK) == 0);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSINACT_INT_MASK) == 0);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXUDR_INT_MASK) == 0);

    USPIxCtlLow(GetUSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSACT_INT_MASK) == USPI_SSACT_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_SSACT_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSACT_INT_MASK) == 0);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSINACT_INT_MASK) == 0);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SLVTO_INT_MASK) == 0);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SLVBE_INT_MASK) == 0);

    /* Check TX BUF under run interrupt flag */
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXUDR_INT_MASK) == USPI_TXUDR_INT_MASK);

    USPIxClkHigh(GetUSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++);

    USPIxClkLow(GetUSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 1000; u32DelayCount++)
    {
        __NOP();
    }

    /* Check slave time-out interrupt flag */
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SLVTO_INT_MASK) == USPI_SLVTO_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_SLVTO_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SLVTO_INT_MASK) == 0);

    USPIxCtlHigh(GetUSPIModuleIdx());

    __NOP();
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSINACT_INT_MASK) == USPI_SSINACT_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_SSINACT_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SSINACT_INT_MASK) == 0);

    /* Clear TX BUF under run interrupt flag */
    USPI_ClearIntFlag(pUSPIModule, USPI_TXUDR_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_TXUDR_INT_MASK) == 0);

    /* Slave bit count error interrupt flag test */
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SLVBE_INT_MASK) == USPI_SLVBE_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_SLVBE_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_SLVBE_INT_MASK) == 0);

    /* Disable self-test function */
    SYS->ALTCTL0 &= ~(SYS_ALTCTL0_SELFTEST_Msk);
    /* Set PA.11 (USPI0_CLK) as USCI function pin */
    USPI0_CLK_PIN_INIT();

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
    __NOP();

    /* RX overrun interrupt flag test */
    /* Master mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_MASTER, USPI_MODE_0, 16, 100000);
    /* Check RX overrun interrupt flag */
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXOV_INT_MASK) == 0);
    /* Write to TX register */
    pUSPIModule->TXDAT = 1;

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    pUSPIModule->TXDAT = 2;

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    pUSPIModule->TXDAT = 3;

    /* Wait data transfer */
    while (pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk)
    {
        __NOP();
    }

