wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
    /* Check RX overrun interrupt flag */
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXOV_INT_MASK) == USPI_RXOV_INT_MASK);
    USPI_ClearIntFlag(pUSPIModule, USPI_RXOV_INT_MASK);
    CU_ASSERT(USPI_GetIntFlag(pUSPIModule, USPI_RXOV_INT_MASK) == 0);

    USPI_Close(pUSPIModule);
}

void API_USCI_SPI_GetStatus()
{
    volatile uint32_t u32DelayCount = 0;
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    /* Slave mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_SLAVE, USPI_MODE_0, 16, NULL);
    /* Check busy flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_BUSY_MASK) == 0);

    /* USCI_SPI TX empty flag test */
    /* Check TX empty flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_TX_EMPTY_MASK) == USPI_TX_EMPTY_MASK);
    /* Write to TX register */
    pUSPIModule->TXDAT = 1;
    /* Check TX empty flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_TX_EMPTY_MASK) == 0);

    /* Check busy flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_BUSY_MASK) == USPI_BUSY_MASK);

    /* USCI_SPI TX full flag test */
    pUSPIModule->BUFCTL |= USPI_BUFCTL_TXCLR_Msk;
    /* Check TX full flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_TX_FULL_MASK) == 0);
    /* Write to TX register */
    pUSPIModule->TXDAT = 2;
    /* Check TX full flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_TX_FULL_MASK) == USPI_TX_FULL_MASK);
    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());
    __NOP();

    /* USCI_SPI RX empty flag test */
    /* Master mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_MASTER, USPI_MODE_0, 16, 100000);
    /* Check RX empty flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_RX_EMPTY_MASK) == USPI_RX_EMPTY_MASK);
    /* Write to TX register */
    pUSPIModule->TXDAT = 1;

    /* Wait data transfer */
    while (pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX empty flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_RX_EMPTY_MASK) == 0);

    /* USCI_SPI RX full flag test */
    /* Check RX full flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_RX_FULL_MASK) == 0);
    /* Write to TX register */
    pUSPIModule->TXDAT = 2;

    while (pUSPIModule->BUFSTS & USPI_BUFSTS_TXFULL_Msk);

    pUSPIModule->TXDAT = 3;

    /* Wait data transfer */
    while (pUSPIModule->PROTSTS & USPI_PROTSTS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX full flag */
    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_RX_FULL_MASK) == USPI_RX_FULL_MASK);

    /* Reset USPIx */
    ResetUSPIxModule(GetUSPIModuleIdx());

    __NOP();

    /* Check USPI_SS line status */
    /* Set PB.0 (USPI0_CTL0) as output mode */
    SET_GPIO_PB0();
    GPIO_SetMode(PB, BIT0, GPIO_MODE_OUTPUT);
    GPIO_SetPullCtl(PB, BIT0, GPIO_PUSEL_DISABLE);

    /* Enable self-test function */
    SYS->ALTCTL0 |= SYS_ALTCTL0_SELFTEST_Msk;
    //printf("SYS SelfTest = 0x%08X\r\n", SYS->ALTCTL0);

    switch (GetUSPIModuleIdx())
    {
        case C_USPI0:
            /* Set PB.0 (USPI0_CTL0) to high level */
            PB0 = 1;
            break;

        case C_USPI1:
            /* Set PB.5 (USPI0_CTL0) to high level */
            PB5 = 1;
            break;

        case C_USPI2:
            /* Set PA.3 (USPI0_CTL0) to high level */
            PA3 = 1;
            break;
    }

    /* Slave mode, USPI mode 0. */
    USPI_Open(pUSPIModule, USPI_SLAVE, USPI_MODE_0, 16, NULL);

    /* Slave selection signal is low-active. */
    pUSPIModule->CTLIN0 |= USPI_CTLIN0_ININV_Msk;

    //pUSPIModule->CTLIN0 = (pUSPIModule->CTLIN0 & (~USPI_CTLIN0_ININV_Msk)) | USPI_CTLIN0_ININV_Msk;
    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_SSLINE_STS_MASK) == USPI_SSLINE_STS_MASK);

    switch (GetUSPIModuleIdx())
    {
        case C_USPI0:
            /* Set PB.0 (USPI0_CTL0) to low level */
            PB0 = 0;
            break;

        case C_USPI1:
            /* Set PB.5 (USPI0_CTL0) to low level */
            PB5 = 0;
            break;

        case C_USPI2:
            /* Set PA.3 (USPI0_CTL0) to low level */
            PA3 = 0;
            break;
    }

    for (u32DelayCount = 0; u32DelayCount < 100; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(USPI_GetStatus(pUSPIModule, USPI_SSLINE_STS_MASK) == 0);
    __NOP();

    /* Disable self-test function */
    //outp32(0x40000014, 0);
    SYS->ALTCTL0 &= ~SYS_ALTCTL0_SELFTEST_Msk;

    USPI_Close(pUSPIModule);
}

#ifdef POWER_DOWN_TEST
void USCI_IRQHandler(void)
{
    NVIC_DisableIRQ(USCI_IRQn);
}

void API_MACRO_USCI_SPI_Wakeup()
{
    /* Reset USPI1 */
    SYS->IPRST2 |= SYS_IPRST2_USCI1RST_Msk;
    SYS->IPRST2 &= ~SYS_IPRST2_USCI1RST_Msk;

    /* Master mode, USPI mode 0. */
    USPI_Open(USPI1, USPI_MASTER, USPI_MODE_0, 16, 100000);

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Enable power wake-up interrupt */
    CLK->PWRCTL |= CLK_PWRCTL_PDWKIEN_Msk;

    NVIC_EnableIRQ(USCI_IRQn);
    //NVIC_EnableIRQ(PWRWU_IRQn);

    /* Enable SPI wake-up */
    USPI_EnableWakeup(USPI1);
    CU_ASSERT((USPI1->WKCTL & USPI_WKCTL_WKEN_Msk) == USPI_WKCTL_WKEN_Msk);

    /* Processor use deep sleep */
    SCB->SCR = SCB_SCR_SLEEPDEEP_Msk;

    /* System power down enable */
    CLK->PWRCTL |= CLK_PWRCTL_PDEN_Msk;

    printf("\n");
    printf("Enter PD 0x%x 0x%x\n", USPI1->PROTCTL, USPI1->PROTSTS);
    printf("\n");
    printf("CHIP enter power down status.\n");

    /* Waiting for UART printf finish*/
    while (!(((UUART0->BUFSTS) & UUART_BUFSTS_TXEMPTY_Msk) >> UUART_BUFSTS_TXEMPTY_Pos))
        if (USPI1->PROTSTS != 0)
        {
            USPI1->PROTSTS = USPI1->PROTSTS;
        }

    /*  Use WFI instruction to idle the CPU. NOTE:
    If ICE is attached, system will wakeup immediately because ICE is a wakeup event. */
    __WFI();
    __NOP();
    __NOP();
    __NOP();

    /* Disable power wake-up interrupt */
    CLK->PWRCTL &= ~CLK_PWRCTL_PDWKIEN_Msk;

    while (!USPI_GET_WAKEUP_FLAG(USPI1));

    CU_ASSERT(USPI_GET_WAKEUP_FLAG(USPI1) == 1);
    USPI_CLR_WAKEUP_FLAG(USPI1);
    CU_ASSERT(USPI_GET_WAKEUP_FLAG(USPI1) == 0);

