wosayttn/M55M1BSP/_CUnit/usci_spi/usci_spi_cunit.c
    /* Lock protected registers */
    SYS_LockReg();

    USPI_DisableWakeup(USPI1);
    CU_ASSERT((USPI1->WKCTL & USPI_WKCTL_WKEN_Msk) == 0);
    USPI_Close(USPI1);

    printf("Wake up!!\n");
}
#else
void API_MACRO_USCI_SPI_Wakeup()
{
    USPI_T *pUSPIModule = NULL;

    pUSPIModule = (USPI_T *)GetUSPIModule(GetUSPIModuleIdx());

    USPI_EnableWakeup(pUSPIModule);
    CU_ASSERT((pUSPIModule->WKCTL & USPI_WKCTL_WKEN_Msk) == USPI_WKCTL_WKEN_Msk);

    USPI_DisableWakeup(pUSPIModule);
    CU_ASSERT((pUSPIModule->WKCTL & USPI_WKCTL_WKEN_Msk) == 0);

#if 0
    USPI_EnableWakeup(USPI0);
    CU_ASSERT((USPI0->WKCTL & USPI_WKCTL_WKEN_Msk) == USPI_WKCTL_WKEN_Msk);

    USPI_DisableWakeup(USPI0);
    CU_ASSERT((USPI0->WKCTL & USPI_WKCTL_WKEN_Msk) == 0);
#endif //0
}
#endif

CU_TestInfo USCI_SPI_MacroTests[] =
{
    {"Enable/Disable USCI_SPI slave 3-wire mode", MACRO_USCI_SPI_ENABLE_DISABLE_3WIRE_MODE},
    {"Get USCI_SPI RX buffer empty flag", MACRO_USCI_SPI_GET_RX_EMPTY_FLAG},
    {"Get USCI_SPI TX buffer empty and full flag", MACRO_USCI_SPI_GET_TX_EMPTY_FULL_FLAG},
    {"Read USCI_SPI RX and write USCI_SPI TX", MACRO_USCI_SPI_WRITE_TX_READ_RX},
    {"Set USCI_SPI SS pin to high state", MACRO_USCI_SPI_SET_SS_HIGH},
    {"Set USCI_SPI SS pin to low state", MACRO_USCI_SPI_SET_SS_LOW},
    {"Set USCI_SPI suspend cycle", MACRO_USCI_SPI_SET_SUSPEND_CYCLE},
    {"Set USCI_SPI transfer sequence with LSB/MSB first", MACRO_USCI_SPI_SET_LSB_MSB_FIRST},
    {"Set USCI_SPI data width", MACRO_USCI_SPI_SET_DATA_WIDTH},
    {"Get USCI_SPI busy flag", MACRO_USCI_SPI_IS_BUSY},
    {"Get/Clear USCI_SPI Protocol/Buffer interrupt flag", MACRO_USCI_SPI_GetIntFlag_ClearIntFlag},
    {"Enable/Disable USCI_SPI Protocol Interrupt", MACRO_USCI_SPI_EnableProtocolInt_DisableProtocolInt},
    {"Enable/Disable USCI_SPI Buffer Interrupt", MACRO_USCI_SPI_EnableBufferInt_DisableBufferInt},
    {"Enable/Disable USCI_SPI Transfer Interrupt", MACRO_USCI_SPI_EnableTransferInt_DisableTransferInt},
    {"Enable/Disable USCI_SPI PDMAt", MACRO_USCI_SPI_EnablePDMA_DisablePDMA},
    CU_TEST_INFO_NULL,
};

CU_TestInfo USCI_SPI_ApiTests[] =
{
    {"USCI_SPI Open", API_USCI_SPI_Open},
    {"USCI_SPI Close", API_USCI_SPI_Close},
    {"Clear USCI_SPI RX buffer", API_USCI_SPI_ClearRxBuf},
    {"Clear USCI_SPI TX buffer", API_USCI_SPI_ClearTxBuf},
    {"Enable/Disable USCI_SPI automatic slave selection function", API_USCI_SPI_EnableAutoSS_DisableAutoSS},
    {"Set/Get USCI_SPI bus clock rate", API_USCI_SPI_SetBusClock_GetBusClock},
    {"Enable/Disable USCI_SPI interrupt function", API_USCI_SPI_EnableInt_DisableInt},
    {"Get/Clear USCI_SPI interrupt flag", API_USCI_SPI_GetIntFlag_ClearIntFlag},
    {"Get USCI_SPI status", API_USCI_SPI_GetStatus},
    CU_TEST_INFO_NULL,
};

CU_TestInfo USCI_SPI_Wakeup_APIMacroTests[] =
{
    {"USCI_SPI wake-up function", API_MACRO_USCI_SPI_Wakeup},
    CU_TEST_INFO_NULL,
};

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
